ERROR_INFO = {
		
	'0': '执行成功',
	'65535' : '未知错误',
	
	//SYSTEM_ERRNO 1 - 10000
	
	//CIFS 10000 - 10999
	'10000' :'CIFS服务状态异常[{0}],请检查CIFS配置或尝试重新设置域配置！',
		
	//SOAP 11000 - 11999
	
	'11000' :'连接存储服务失败，请刷新后重试或重新启动（storage-soap服务）',
		
	// ACCOUNT 12000 - 12999
	'12000'	: '用户[{0}]不存在',/* User is not exist */
	'12001'	: '用户[{0}]存在',/* User is exist */
	'12002' : '没有可用UID',	/* No extra user id for free */
	'12003'	: '设置SMB账户失败', /* Set account smb failed */
	'12004'	: '更新密码文件失败',/* Update account file failure */
	'12005' : '组[{0}]不存在',	/* Group is not exist */
	'12006' : '组[{0}]不存在',	/* Group is exist */
	'12007' : '删除SMB账号失败',	/* Unset account smb failed */
	'12008'	: '用户[{0}]已经在组[{1}]中', /* User is in group */
	'12009' : '组[{0}]是默认组，不可以删除',	/* The group is default group, can not delete */
	'12010'	: '用户[{0}]被锁定，不可以进行该操作',/* User password is lock, can't operate */
	'12011'	: '用户[{0}]密码不匹配',/* Input  password is not match */
	
	//BASE 13000 - 13999
	
	//FILE 14000 - 14999
	
	
	//WEB  15000 - 15999
	'15000': '请求类型错误！',
	'15001': '请求参数错误！',
	'15002': '请求命令无效！',
	'15003'	: '获取客户端IP信息失败！',
	'15004': '另一个IP[{0}]正在访问！',
	'15005': '需要登录！',
		
	//Base error
	'-1': '文件或目录不存在！',
	'-2': 'JSON文件不存在！',
	'-3': 'JSON文件删除失败！',
	'-4': 'JSON对象为NULL！',
	'-5': 'JSON对象写入文件失败！',
	'-6': '功能没有实现！',
	'-7': '对象不存在或系统错误！',
	'-8': '获取ID失败！',
	'-9': '更新ID失败！',
	'-10': '删除文件失败！',
	'-11': '对象为NULL！',
	'-12': '无效的参数！',
	'-13': '执行任务失败！',
	'-14': '获取最新信息失败！',
	'-15': '进程不存在，任务失败!',
	'-16': '任务文件丢失',
	'-17': '进程状态不正确，任务失败！',
	'-18': '读取任务文件失败！',
	'-19': '任务不可停止！',
	'-20': '终止任务失败！',
	'-21': '重启失败！',
	'-22': '清除文件失败！',
	'-23': '分配内存失败',
	'-24': '导出日志失败',
	'-31': '命令执行失败',
	'-32': '不支持的命令',
	'-33': '任务未运行',
	'-34': '获取任务PID失败',
		
	//DiskArray error
	'-301': '外置存储不存在！',
	'-302': '外置存储正在被使用！',
	'-303': '外置存储路径无效！',
	'-304': '外置存储被损坏！',

	//Disk error
	'-401': '磁盘不存在！',
	'-402': '磁盘正在被使用！',
	'-403': '磁盘路径无效！',
	'-404': '磁盘损坏',
	'-405': '磁盘错误: sg_io！',
	'-406': '磁盘错误: sense data',
	'-407': '磁盘错误: scsi status！',
	'-408': '磁盘错误: host status！',
	'-409': '磁盘错误: driver status！',
	'-410': '磁盘错误: 未知错误！',
	'-411': '磁盘错误: 打开设备失败！',
	'-412': '磁盘错误: memalign！',

	//Store error
	
	'-601': '存储不存在！',
	'-602': '存储已经存在！',
	'-603': '存储激活失败！',
	'-604': '存储冻结失败！',
	'-605': '存储容量变更失败！',
	
	//StoreDevice error
	'-1001': '块设备不存在！',
	'-1002': '块设备已经存在！',
	'-1003': '创建块设备失败！',
	'-1004': '删除块设备失败！',

	//FsVolume error
	'-1101': '文件系统不存在！',
	'-1102': '文件系统已经存在！',
	'-1103': '创建文件系统失败！',
	'-1104': '删除文件系统失败！',
	'-1105': '文件系统设备路径不存在！',
	'-1105': '设置文件系统属性失败！',
	
	//Acl error
	'-1301': '获取ACL信息失败',
	'-1302': '设置ACL失败',
	'-1303': 'ACL参数错误',

	//Dir error
	'-1401': '上级目录不允许写入权限',
	'-1402': '名称已存在',
	'-1403': '用户权限不允许操作',
	'-1404': '当前目录使用中',
	'-1405': '创建目录失败',
	'-1406': '删除目录失败',
	'-1407': '改变权限失败',
	'-1408': '改变所属失败',
	'-1409': '改变名称失败',
	'-1410': '目录不为空',
	'-1411': '只读文件系统',

	//Port error
	'-1501': '端口不存在！',
	'-1502': '端口已经存在！',
	'-1503': '端口速度未设置！',
	'-1504': '端口速度无效！',
	'-1505': '端口拓扑类型未设置！',
	'-1506': '端口拓扑类型无效！',
	'-1507': '端口配置已经该更，需要重启后生效！',
	
	//Lunmask error
	'-1601': '映射不存在！',
	'-1602': '映射已经存在！',
	'-1603': '设备已经在映射组中！',
	'-1604': '映射设备文件无法打开',
	'-1605': '映射设备文件无法写入',
	'-1606': '映射组目录无法打开',
	'-1607': '映射文件无法打开',
	'-1608': '映射文件无法写入',
	'-1609': '映射用户文件无法打开',
	'-1610': '映射用户文件无法写入',
	'-1611': '删除映射失败',
	'-1612': '删除映射设备NVRAM值失败',
	'-1613': '设置映射设备NVRAM值失败',
	'-1614': '设置映射NVRAM值失败',
	'-1615': '删除映射NVRAM值失败',
	'-1616': 'Session文件访问失败',
	'-1617': '映射设备已经存在',
	'-1618': '别名设置失败',
	'-1619': '添加映射失败',
	'-1620': 'POPEN失败',
	'-1621': '添加主机iqn失败',
	'-1622': '删除主机iqn失败',
	'-1623': '创建TPG失败',
	'-1624': '创建目标组失败',
	'-1625': '显示目标失败',
	'-1626': '创建目标失败',
	'-1627': '下线目标失败',
	'-1628': '添加目标组成员失败',
	'-1629': '上线目标失败',
	'-1630': '创建主机组失败',
	'-1631': '显示逻辑单元失败',
	'-1632': '获取逻辑单元失败',
	'-1633': '显示主机组失败',
	'-1634': '创建逻辑单元失败',
	'-1635': '删除逻辑单元失败',
    "-1640": "繁忙",//STMF_ERROR_BUSY
    "-1641": "不存在",//STMF_ERROR_NOT_FOUND
    "-1642": "成员不存在",//STMF_ERROR_MEMBER_NOT_FOUND
    "-1643": "组不存在",//STMF_ERROR_GROUP_NOT_FOUND
    "-1644": "无权限",//STMF_ERROR_PERM
    "-1645": "内存不够",//STMF_ERROR_NOMEM
    "-1646": "无效参数",//STMF_ERROR_INVALID_ARG
    "-1647": "已经存在",//STMF_ERROR_EXISTS
    "-1648": "服务不存在",//STMF_ERROR_SERVICE_NOT_FOUND
    "-1649": "服务在线",//STMF_ERROR_SERVICE_ONLINE
    "-1650": "服务离线",//STMF_ERROR_SERVICE_OFFLINE
    "-1651": "组在使用",//STMF_ERROR_GROUP_IN_USE
    "-1652": "LUN在使用",//STMF_ERROR_LUN_IN_USE
    "-1653": "VIEW冲突",//STMF_ERROR_VE_CONFLICT
    "-1654": "无配置",//STMF_ERROR_CONFIG_NONE
    "-1655": "服务数据版本错误",//STMF_ERROR_SERVICE_DATA_VERSION
    "-1656": "无效主机组",//STMF_ERROR_INVALID_HG
    "-1657": "无效目标组",//STMF_ERROR_INVALID_TG
    "-1658": "数据太旧",//STMF_ERROR_PROV_DATA_STALE
    "-1659": "无属性",//STMF_ERROR_NO_PROP
    "-1660": "无属性值",//STMF_ERROR_NO_PROP_VAL
    "-1661": "丢失属性值",//STMF_ERROR_MISSING_PROP_VAL
    "-1662": "无效块大小",//STMF_ERROR_INVALID_BLOCKSIZE
    "-1663": "文件已准备",//STMF_ERROR_FILE_ALREADY
    "-1664": "无效属性大小",//STMF_ERROR_INVALID_PROPSIZE
    "-1665": "无效属性",//STMF_ERROR_INVALID_PROP
    "-1666": "STMF_ERROR_PERSIST_TYPE",//STMF_ERROR_PERSIST_TYPE
    "-1667": "目标组在线",//STMF_ERROR_TG_ONLINE
    "-1668": "已设置访问状态",//STMF_ERROR_ACCESS_STATE_SET
    "-1669": "STMF_ERROR_NO_PROP_STANDBY",//STMF_ERROR_NO_PROP_STANDBY
    "-1670": "传递消息失败",//STMF_ERROR_POST_MSG_FAILED
    "-1671": "STMF_ERROR_DOOR_INSTALLED",//STMF_ERROR_DOOR_INSTALLED
    "-1672": "文件使用中",//STMF_ERROR_FILE_IN_USE
    "-1673": "STMF_ERROR_INVALID_BLKSIZE",//STMF_ERROR_INVALID_BLKSIZE
    "-1674": "GUID使用中",//STMF_ERROR_GUID_IN_USE
    "-1675": "元数据文件名",//STMF_ERROR_META_FILE_NAME
    "-1676": "数据文件名字",//STMF_ERROR_DATA_FILE_NAME
    "-1677": "大小超出范围",//STMF_ERROR_SIZE_OUT_OF_RANGE
    "-1678": "LU繁忙",//STMF_ERROR_LU_BUSY
    "-1679": "元创建",//STMF_ERROR_META_CREATION
    "-1680": "文件大小无效",//STMF_ERROR_FILE_SIZE_INVALID
    "-1681": "已设置写缓存",//STMF_ERROR_WRITE_CACHE_SET

	// error
	'-1701': '已到文件尾',
	'-1702': '已到文件头',
	'-1703': '读文件错误',

	//Rep error
	'-1801': '获取任务策略失败',
	'-1802': '更新策略失败',
	'-1803': '更新策略文件失败',
	'-1804': '更新导出文件失败',
	'-1805': '更新别名文件失败',
	'-1806': '更新旧策略文件失败',
	'-1807': '运行任务失败',
	'-1808': '配置丢失',

	//Config error
	'-2001': '设置IP地址失败',
	'-2002': '设置网络掩码失败',
	'-2003': '设置网关失败',
	'-2004': '设置DNS失败',
	'-2005': '设置网络配置NVRAM失败',
	'-2006': '设置VTL配置NVRAM失败',
	'-2007': '设置监控配置NVRAM失败',
	'-2008': 'DNS解析失败，无法发送测试邮件',
	'-2009': '登录失败，无法发送测试邮件',
	'-2010': '发送测试邮件失败，请检查邮件配置',
	'-2011': '启动监控失败',
	'-2012': '设置时间失败',
	'-2013': '设置许可失败，请检查许可码',
	'-2014': '网关没有设置',
	'-2015': 'DNS没有设置',
	'-2016': '并行配置更改，请重启',
	'-2017': '温度超过警告值',
	'-2018': '风扇停止',
	'-2019': '邮箱错误',
	'-2020': '发送邮件失败，DNS不能解析',
	'-2021': '发送邮件失败，登录错误',
	'-2022': '发送邮件失败',
	'-2023': '设置MTU值失败',
	'-2024': '建立Socket失败',
	'-2025': '获取邮箱服务器IP失败',
	'-2026': '连接邮箱服务器失败',
	'-2027': '获取IP配置失败',
	'-2028': '设置IP失败',
	'-2029': '获取LDAP信息失败',
	'-2030': '设置LDAP配置失败',
	'-2031': '获取域信息失败',
	'-2032': '设置域配置失败',
	
	'-2033' : '设置DNS失败',			/* RSA算法不生效*/
	'-2301'	: '获得host信息失败',		/*获得host信息失败*/
	'-2034' : '无效的key',			/* 无效的key*/
	'-2035' : 'license配置丢失',			/* license配置丢失*/
	'-2036' : 'license配置错误，没有指定hostId',			/* license配置错误，没有指定hostId*/
	'-2037': '设置resolve文件失败',   /*create resolve config failure*/
	'-2038': '设置krb文件失败',
	'-2039': '更新网络时间失败',
	'-2040': '停止smb服务失败',
	'-2041': '启动smb服务失败',
	'-2042': '回滚resolve配置失败',
	'-2043': '回滚krb配置失败',
	'-2044': '用户名或密码错误',
	'-2045': '加入工作组失败',
	'-2046' : 'RSA算法不生效',			/* RSA算法不生效*/
	/* ldap error */
	"-2047":'无法设置参数',
	"-2048":'无法设置参数: 无效的baseDN',
	"-2049":'无法设置参数: 无效的LADP服务器',
	"-2050":'无法设置参数: 无效的凭据级',
	"-2051":'无法设置参数: 无效的域名',
	"-2052":'无法设置参数: 无效的认证方法',
	"-2053":'无法设置参数: 无效的proxyDN',
	"-2054":'无法设置参数: 无效的proxyPassword',
	"-2055":'无法设置参数: 无效的用户DN',
	"-2056":'无法设置参数: 无效的组DN',
	"-2057":'无法设置参数: 无效的网络DN',
	"-2058":'密码不一致',
	"-2059":'用户名不存在',
	"-2060":'配置license失败',
	"-2061":'无效的license',
	"-2062":'无效的license: HostID不匹配',
	"-2063":'删除license失败',
	"-2064":'该端口正在被监听',
	"-2065":'写入配置文件失败',
	"-2066":'运行hostname命令失败',
	"-2067":'运行domainname命令失败',
	"-2068":'写入配置文件失败',
	"-2069":'该端口正在被监听',
	"-2070":'写入配置文件失败',
	"-2150":'加入域失败',
	"-2151":'找不到该域控制器',
	"-2160":'配置WINS服务失败',
	
	//Upgrade error
	'-2101': '升级失败！没有找到MD5文件！',
	'-2102': '升级失败！没有找到对应文件！',
	'-2103': '升级失败！MD5值不匹配！',
	'-2104': '升级失败！获取文件MD5失败！',
	'-2105': '升级失败！打开IPK目录失败！',
	'-2106': '升级失败！更新uboot失败！',
	'-2107': '升级失败！更新uImage失败！',
	'-2108': '升级失败！更新dtb失败！',
	'-2109': '升级失败！更新initrd失败！',
	'-2110': '升级失败！更新bit tool 失败！',
	'-2111': '升级失败！更新bit失败！',

	'-2113': '升级失败！更新ipk失败！',
	'-2114': '升级失败！文件无效！',
	'-2115': '升级失败！解压文件失败！',
	'-2116':'升级完成，需要重新启动',

	//Share error
	'-2201':'获取IDMAP列表失败',
	'-2202':'设置IDMAP失败',
	'-2203':'清除IDMAP失败',
	'-2204':'设置CIFS失败',
	'-2205':'设置NFS失败',
	'-2206':'关闭CIFS失败',
	'-2207':'关闭NFS失败',
	
	//Zfs error
	'-3000':'内存不足',
	'-3001':'无效的属性值',
	'-3002':'只读属性',
	'-3003':'属性不适用于数据集类型',
	'-3004':'属性不可继承',
	'-3005':'无效配额或保留',
	'-3006':'不适用于数据集类型',
	'-3007':'存储池或数据集在使用中',
	'-3008':'存储池或数据集已经存在',
	'-3009':'存储池或数据集不存在',
	'-3010':'无效备份流',
	'-3011':'数据集是只读',
	'-3012':'卷大小超过系统限制',
	'-3013':'无效的名称',
	'-3014':'无法恢复到目的地',
	'-3015':'备份失败',
	'-3016':'无效的目标设备',
	'-3017':'存储池中设备不存在',
	'-3018':'无效的设备',
	'-3019':'没有有效的副本',
	'-3020':'正在同步',
	'-3021':'不支持的版本',
	'-3022':'存储池不可用',
	'-3023':'太多的设备',
	'-3024':'必须是绝对路径',
	'-3025':'越过数据集或存储池操作',
	'-3026':'数据集由本地区域使用',
	'-3027':'装载失败',
	'-3028':'卸载失败',
	'-3029':'取消共享失败',
	'-3030':'分享失败',
	'-3031':'权限被拒绝',
	'-3032':'超出空间',
	'-3033':'错误的地址',
	'-3034':'I/O错误',
	'-3035':'接收到信号',
	'-3036':'设备预留为热备',
	'-3037':'无效的vdev配置',
	'-3038':'递归数据集依赖',
	'-3039':'没有历史对象',
	'-3040':'未能检索存储池属性',
	'-3041':'操作不支持此类型的存储池',
	'-3042':'操作存储池的参数无效',
	'-3043':'数据集的名称太长',
	'-3044':'打开设备失败',
	'-3045':'磁盘容量的信息无法检索',
	'-3046':'写标签失败',
	'-3047':'无效的权限组/用户',
	'-3048':'无效的权限',
	'-3049':'无效的权限集的名称',
	'-3050':'委托管理已禁用',
	'-3051':'SMB停止共享失败',
	'-3052':'SMB添加共享失败',
	'-3053':'无效的缓存文件',
	'-3054':'设备已经作为缓存使用',
	'-3055':'不支持的vdev型',
	'-3056':'选项在此数据集不支持',
	'-3057':'存储池已经共享备用设备',
	'-3058':'日志记录设备unplayed',
	'-3059':'标签不存在',
	'-3060':'标签已经存在',
	'-3061':'标签太长',
	'-3062':'管道创建失败',
	'-3063':'线程创建失败',
	'-3064':'这个磁盘被分裂成一个新的存储池',
	'-3065':'清理中',
	'-3066':'没有主动清理',
	'-3067':'无法生成diff',
	'-3068':'无效的diff数据',
	'-3069':'存储池只读模式',
	'-3070':'未知错误',
	'-3071':'初始化zpool失败',
	'-3072':'初始化zfs失败',
	'-3073':'设置root权限失败',
	'-3074':'执行命令失败',
	'-3075':'至少需要2个设备',
	'-3076':'至少需要3个设备',
	'-3077':'存储池名称无效',
	'-3078':'生成根VDEV错误，尝试使用"强制"选项',
	'-3079':'存储池 list 命令失败',
	'-3080':'存储池 status 命令失败',
	'-3081':'存储池 get 命令失败',
	'-3082':'存储池 set 命令失败',
	'-3083':'"快照"或者"克隆"存在',
	'-3084':'有依赖的"快照"或者/和"克隆"存在',
	'-3085':'销毁"快照"或者"克隆"失败',
	
	'-3900':'zfs活跃',
	'-3901':'zfs待用',
	'-3902':'zfs严重错误',
	'-3903':'zfs在线',
	'-3904':'zfs离线',
	'-3905':'zfs移除',
	'-3906':'zfs分离',
	'-3907':'zfs可用',
	'-3908':'zfs不可用',
	'-3909':'zfs降级',
	'-3910':'zfs使用中',
	'-3911':'zfs未知错误',
	'-3912':'zfs无错误',
	'-3920':'磁盘预知错误',
	'-3921':'磁盘温度过热',
	'-3922':'磁盘自检失败',
	'-3923':'磁盘严重预知错误',
	'-3924':'磁盘温度严重过热',
	'-3925':'磁盘自检严重失败',
	'-3926':'磁盘传输错误',
	'-3927':'磁盘错误恢复',
	'-3928':'磁盘底层错误',
	'-3929':'磁盘介质错误',
	'-3930':'磁盘设备错误',
	'-3931':'磁盘错误',
	'-3932':'磁盘介质严重错误',
	'-3933':'磁盘设备严重错误',
	'-3934':'添加磁盘',
	'-3935':'移除磁盘',
	'-3940':'光纤卡附加',
	'-3941':'光纤卡分离',
	'-3942':'光纤卡在线',
	'-3943':'光纤卡离线',
	'-3944':'光纤卡扫描',
	'-3945':'光纤卡添加目标设备',
	'-3946':'光纤卡移除目标设备',
	'-3950':'添加以太网',
	'-3960':'正常',
	'-3961':'低于不可恢复阀值下限',
	'-3962':'高于不可恢复阀值上限',
	'-3963':'低于严重阀值下限',
	'-3964':'高于严重阀值上限',
	'-3965':'低于阀值下限',
	'-3966':'高于阀值上限',
	'-3991':'存储池是一个更新的版本',
	'-3992':'存储池正在被用',
	'-3993':'不能导入存储池',
	'-3995':'没有可用的存储池',
	'-3994':'不能 mount 数据集',
	'-3996':'一个或多个设备是目前不可用',
	
	'-4000':'产品配置没有发现',
	'-4001':'产品配置初始化失败',
	'-4002':'未知主机',
	'-4003':'主机连接失败',
	'-4004':'主机无响应',
	'-4005':'该版本不支持该功能，请升级为最新版本后尝试',
	'-4006':'Soap服务没有准备好，请刷新后重试！如无效请联系客服！',
	'-4007':'PIS服务没找到, 请确定IP后再输入！',

	'-4401':'该磁盘不存在',
	'-4500':'编辑失败，无此项定时任务',
	'-5901':'操作文件失败',
	'-5902':'端口已被监听',
	'-6000':'参数错误',
	'-6001':'执行添加映射指令失败',
	'-6002':'执行删除映射指令失败',
	'-6003':'执行指令失败',
	
	'-15005' : '需要登录',
	'-15007' : '用户不存在',
	'-15008' : '密码错误',
	'-15010' : '验证码错误',
	'-15011' : '联系人已存在',
	'-15018' : '联系人不能添加自己',
	
	'-10002' : '密码错误',
	'-10009' : '用户没有授予访问平台的角色',
	'-10010' : '用户没有授予访问平台的角色'
	
};

ERROR_NUM = {
	//base error
	NOT_EXIST : '-10000',                  //内容不存在
	STATUS_NOT_CHANGE : '-10001',          //状态不可更改
	EXISTED : '-10002',                    //内容已存在
	PARAM_IS_ERROR : '-10003',             //参数不正确

	//questionnaire error
	ANOTHER_QUE_RELEASED : '-20000',       //另一个问卷已发布
};